#!/bin/sh
prog=${1:-o//bru2bin}

t() {
  y="$(printf %s "$2" | $x)" || {
    printf %s\\n "$x: $2 return code: '$?'" >&2
    exit 1
  }
  if ! [ "$y" = "$1" ]; then
    printf %s\\n "$x: $2 failed: want '$1' got '$y'" >&2
    exit 1
  fi
}

x="$prog -0"

t 0010                           'λ 0'
t 000010                         'λ λ 0'
t 00011010                       'λ (0 0)'
t 000100011100110100001110011010 'λ (λ 1 (0 0)) (λ 1 (0 0))'

x="$prog -1"

t 0010                                  'λ 1'
t 000010                                'λ λ 1'
t 000100011100110100001110011010        'λ (λ 2 (1 1)) (λ 2 (1 1))'
t 0000000000000000000000001111111111110 'λ λ λ λ λ λ λ λ λ λ λ λ 12'
